In [3]:
import numpy as np
import pandas as pd

In [4]:
!pip install xlrd

Requirement already satisfied: xlrd in e:\programdata\anaconda3\lib\site-packages (1.2.0)

## Import the Data File to Pandas

In [5]:
df = pd.read_excel('canada.xlsx', sheet_name = 'Canada by Citizenship', skiprows=range(20), skipfooter=2)

In [6]:
df.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0,...,0,0,1,1,0,0,0,0,1,1

## Filtering Data using Area Name

In [7]:
filtered_data = df[df.AreaName == 'Asia']

In [8]:
filtered_data.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
8,Immigrants,Foreigners,Armenia,935,Asia,922,Western Asia,902,Developing regions,0,...,147,224,218,198,205,267,252,236,258,207
11,Immigrants,Foreigners,Azerbaijan,935,Asia,922,Western Asia,902,Developing regions,0,...,230,359,236,203,125,165,209,138,161,57
13,Immigrants,Foreigners,Bahrain,935,Asia,922,Western Asia,902,Developing regions,0,...,12,12,12,22,9,35,28,21,39,32
14,Immigrants,Foreigners,Bangladesh,935,Asia,5501,Southern Asia,902,Developing regions,83,...,2660,4171,4014,2897,2939,2104,4721,2694,2640,3789

## Adding a Row and Column, and make a total columnwise and Row Wise

In [9]:
years = list(map(int,range(1980,2014)))

In [10]:
df[years]

,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,16,39,39,47,71,340,496,741,828,1076,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,1,0,0,0,0,0,1,2,2,3,...,1450,1223,856,702,560,716,561,539,620,603
2,80,67,71,69,63,44,69,132,242,434,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,0,1,0,0,0,0,0,1,0,1,...,0,0,1,0,0,0,0,0,0,0
4,0,0,0,0,0,0,2,0,0,0,...,0,0,1,1,0,0,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
190,1191,1829,2162,3404,7583,5907,2741,1406,1411,3004,...,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
191,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
192,1,2,1,6,0,18,7,12,7,18,...,124,161,140,122,133,128,211,160,174,217
193,11,17,11,7,16,9,15,23,44,68,...,56,91,77,71,64,60,102,69,46,59
194,72,114,102,44,32,29,43,68,99,187,...,1450,615,454,663,611,508,494,434,437,407

## Adding new column, and sum the exisiting Data

In [11]:
df['Total'] = df[years].sum(axis = 1, skipna = True)

In [12]:
df.loc['Coulumn_Total',:] = df[years].sum(axis=0, skipna = True)

## Fill NA with empty string

In [13]:
df = df.fillna('')

In [14]:
df.tail()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
191,Immigrants,Foreigners,Western Sahara,903,Africa,912,Northern Africa,902,Developing regions,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2
192,Immigrants,Foreigners,Yemen,935,Asia,922,Western Asia,902,Developing regions,1.0,...,161.0,140.0,122.0,133.0,128.0,211.0,160.0,174.0,217.0,2985
193,Immigrants,Foreigners,Zambia,903,Africa,910,Eastern Africa,902,Developing regions,11.0,...,91.0,77.0,71.0,64.0,60.0,102.0,69.0,46.0,59.0,1677
194,Immigrants,Foreigners,Zimbabwe,903,Africa,910,Eastern Africa,902,Developing regions,72.0,...,615.0,454.0,663.0,611.0,508.0,494.0,434.0,437.0,407.0,8598
Coulumn_Total,,,,,,,,,,99137.0,...,257457.0,247057.0,232405.0,243047.0,248768.0,276956.0,246194.0,256222.0,257537.0,

## Change the Complete Column to Numeric

In [ ]:
df[["Total"]] = df[["Total"]].apply(pd.to_numeric)

## Assingn the Filtered data to another Data Frame

In [22]:
filterd_data1 = df[(df.Total > 3000)]

In [23]:
filterd_data2 = df[(df.Total > 3000)&(df.AreaName == 'Asia')]

In [24]:
filterd_data1.tail()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
186,Immigrants,Foreigners,Uruguay,904,Latin America and the Caribbean,931,South America,902,Developing regions,128.0,...,217.0,175.0,147.0,160.0,99.0,93.0,81.0,47.0,58.0,4715.0
187,Immigrants,Foreigners,Uzbekistan,935,Asia,5500,Central Asia,902,Developing regions,0.0,...,330.0,262.0,284.0,215.0,288.0,289.0,162.0,235.0,167.0,3368.0
189,Immigrants,Foreigners,Venezuela (Bolivarian Republic of),904,Latin America and the Caribbean,931,South America,902,Developing regions,103.0,...,1211.0,1192.0,1335.0,1239.0,1353.0,998.0,1452.0,1373.0,1022.0,21267.0
190,Immigrants,Foreigners,Viet Nam,935,Asia,920,South-Eastern Asia,902,Developing regions,1191.0,...,1852.0,3153.0,2574.0,1784.0,2171.0,1942.0,1723.0,1731.0,2112.0,97146.0
194,Immigrants,Foreigners,Zimbabwe,903,Africa,910,Eastern Africa,902,Developing regions,72.0,...,615.0,454.0,663.0,611.0,508.0,494.0,434.0,437.0,407.0,8598.0

In [25]:
filterd_data2.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16.0,...,3436.0,3009.0,2652.0,2111.0,1746.0,1758.0,2203.0,2635.0,2004.0,58639.0
8,Immigrants,Foreigners,Armenia,935,Asia,922,Western Asia,902,Developing regions,0.0,...,224.0,218.0,198.0,205.0,267.0,252.0,236.0,258.0,207.0,3310.0
14,Immigrants,Foreigners,Bangladesh,935,Asia,5501,Southern Asia,902,Developing regions,83.0,...,4171.0,4014.0,2897.0,2939.0,2104.0,4721.0,2694.0,2640.0,3789.0,65568.0
20,Immigrants,Foreigners,Bhutan,935,Asia,5501,Southern Asia,902,Developing regions,0.0,...,5.0,10.0,7.0,36.0,865.0,1464.0,1879.0,1075.0,487.0,5876.0
30,Immigrants,Foreigners,Cambodia,935,Asia,920,South-Eastern Asia,902,Developing regions,12.0,...,370.0,529.0,460.0,354.0,203.0,200.0,196.0,233.0,288.0,6538.0

## Mean

In [30]:
df[years].apply(np.mean)

1980    1011.602041
1981    1128.193878
1982    1063.989796
1983     770.918367
1984     749.153061
1985     714.061224
1986     878.040816
1987    1375.214286
1988    1421.489796
1989    1677.877551
1990    1918.918367
1991    2117.438776
1992    2262.112245
1993    2265.806122
1994    1976.173469
1995    1915.428571
1996    2041.683673
1997    1968.214286
1998    1640.071429
1999    1834.877551
2000    2211.346939
2001    2475.948980
2002    2276.642857
2003    2217.316327
2004    2368.193878
2005    2627.112245
2006    2520.989796
2007    2371.479592
2008    2480.071429
2009    2538.448980
2010    2826.081633
2011    2512.183673
2012    2614.510204
2013    2627.928571
dtype: float64

In [31]:
df[years].apply(np.mean, axis=1)

0                  1724.676471
1                   461.735294
2                  2042.323529
3                     0.176471
4                     0.441176
                     ...
191                   0.058824
192                  87.794118
193                  49.323529
194                 252.882353
Coulumn_Total    188504.500000
Length: 196, dtype: float64

## Get the Range for each Year Column

In [32]:
df[years].apply(lambda x:x.max()-x.min())

1980     99137.0
1981    110563.0
1982    104271.0
1983     75550.0
1984     73417.0
1985     69978.0
1986     86048.0
1987    134771.0
1988    139306.0
1989    164432.0
1990    188054.0
1991    207509.0
1992    221687.0
1993    222049.0
1994    193665.0
1995    187712.0
1996    200085.0
1997    192885.0
1998    160727.0
1999    179818.0
2000    216712.0
2001    242643.0
2002    223111.0
2003    217297.0
2004    232083.0
2005    257457.0
2006    247057.0
2007    232405.0
2008    243047.0
2009    248768.0
2010    276956.0
2011    246194.0
2012    256222.0
2013    257537.0
dtype: float64

## Use With Functions

In [33]:
def predicted_immigrants(x):
    immigrants_2014 = x * 1.12
    return immigrants_2014

df['predicted_immigrants'] = df[2013].apply(predicted_immigrants)

In [34]:
df.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2006,2007,2008,2009,2010,2011,2012,2013,Total,predicted_immigrants
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16.0,...,3009.0,2652.0,2111.0,1746.0,1758.0,2203.0,2635.0,2004.0,58639,2244.48
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1.0,...,856.0,702.0,560.0,716.0,561.0,539.0,620.0,603.0,15699,675.36
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80.0,...,4807.0,3623.0,4005.0,5393.0,4752.0,4325.0,3774.0,4331.0,69439,4850.72
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,6,0.00
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0.0,...,1.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,15,1.12

## Count the total number of NaNs present: (Column wise & All)

In [35]:
df.isnull().sum()

Type                    0
Coverage                0
OdName                  0
AREA                    0
AreaName                0
REG                     0
RegName                 0
DEV                     0
DevName                 0
1980                    0
1981                    0
1982                    0
1983                    0
1984                    0
1985                    0
1986                    0
1987                    0
1988                    0
1989                    0
1990                    0
1991                    0
1992                    0
1993                    0
1994                    0
1995                    0
1996                    0
1997                    0
1998                    0
1999                    0
2000                    0
2001                    0
2002                    0
2003                    0
2004                    0
2005                    0
2006                    0
2007                    0
2008                    0
2009                    0
2010                    0
2011                    0
2012                    0
2013                    0
Total                   0
predicted_immigrants    0
dtype: int64

In [36]:
df.isnull().sum().sum()

0

In [26]:
df.'2006' = df.2006.fillna("xxx")

SyntaxError: invalid syntax (<ipython-input-26-d8b2fb7fe2b4>, line 1)

In [28]:
df.head(4)

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16.0,...,3436.0,3009.0,2652.0,2111.0,1746.0,1758.0,2203.0,2635.0,2004.0,58639.0
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1.0,...,1223.0,856.0,702.0,560.0,716.0,561.0,539.0,620.0,603.0,15699.0
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80.0,...,3626.0,4807.0,3623.0,4005.0,5393.0,4752.0,4325.0,3774.0,4331.0,69439.0
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,6.0

## Change the N/A Column to 'xxx'

In [33]:
df[2006] = df[2006].fillna("xxx")

In [34]:
df.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16.0,...,3436.0,3009.0,2652.0,2111.0,1746.0,1758.0,2203.0,2635.0,2004.0,58639.0
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1.0,...,1223.0,856.0,702.0,560.0,716.0,561.0,539.0,620.0,603.0,15699.0
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80.0,...,3626.0,4807.0,3623.0,4005.0,5393.0,4752.0,4325.0,3774.0,4331.0,69439.0
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,6.0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0.0,...,0.0,1.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,15.0

In [38]:
filtered_data3 = df[df[2006] == 'xxx']

In [39]:
filtered_data3

Empty DataFrame
Columns: [Type, Coverage, OdName, AREA, AreaName, REG, RegName, DEV, DevName, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, Total]
Index: []

[0 rows x 44 columns]